## Plan for api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                NAME                                |
|--------|--------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.lambda-api-errors`               |
|        | `aws_cloudwatch_metric_alarm.logs-1-api-error-1-minute-warning`    |
| delete | `aws_cloudwatch_metric_alarm.logs-10-4xx-error-5-minutes-critical` |
|        | `aws_cloudwatch_metric_alarm.logs-5-4xx-error-1-minute-warning`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.lambda-api-errors will be created
  + resource "aws_cloudwatch_log_metric_filter" "lambda-api-errors" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/api"
      + name           = "api-errors"
      + pattern        = "?ERROR ?Error ?error"

      + metric_transformation {
          + name      = "api-errors"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.logs-1-api-error-1-minute-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-1-api-error-1-minute-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:762579868088:warning-alert-list-manager",
        ]
      + alarm_description                     = "One API error in 1 minute"
      + alarm_name                            = "logs-1-api-error-1-minute-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "api-errors"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:762579868088:warning-alert-list-manager",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.logs-10-4xx-error-5-minutes-critical will be destroyed
  # (because aws_cloudwatch_metric_alarm.logs-10-4xx-error-5-minutes-critical is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "logs-10-4xx-error-5-minutes-critical" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:762579868088:critical-alert-list-manager",
        ] -> null
      - alarm_description         = "Ten 4xx errors in 5 minutes" -> null
      - alarm_name                = "logs-10-4xx-error-5-minutes-critical" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:762579868088:alarm:logs-10-4xx-error-5-minutes-critical" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "ApiName" = "api-gateway"
        } -> null
      - evaluation_periods        = 1 -> null
      - id                        = "logs-10-4xx-error-5-minutes-critical" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "4XXError" -> null
      - namespace                 = "AWS/ApiGateway" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:762579868088:critical-alert-list-manager",
        ] -> null
      - period                    = 300 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 10 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.logs-5-4xx-error-1-minute-warning will be destroyed
  # (because aws_cloudwatch_metric_alarm.logs-5-4xx-error-1-minute-warning is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "logs-5-4xx-error-1-minute-warning" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:762579868088:warning-alert-list-manager",
        ] -> null
      - alarm_description         = "Five 4xx error in 1 minute" -> null
      - alarm_name                = "logs-5-4xx-error-1-minute-warning" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:762579868088:alarm:logs-5-4xx-error-1-minute-warning" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "ApiName" = "api-gateway"
        } -> null
      - evaluation_periods        = 1 -> null
      - id                        = "logs-5-4xx-error-1-minute-warning" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "4XXError" -> null
      - namespace                 = "AWS/ApiGateway" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:762579868088:warning-alert-list-manager",
        ] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 5 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.vpc.aws_eip.nat,
  on .terraform/modules/vpc/vpc/main.tf line 40, in resource "aws_eip" "nat":
  40:   vpc = true

use domain attribute instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.lambda-api-errors"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.list_manager_certificate"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.every-three-minutes"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_access"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-above-maximum-latency-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-above-maximum-latency-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-invalid-auth-token-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-429-error-1-minute-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-5XX-error-1-minute-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-api-error-1-minute-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-429-error-5-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-5XX-error-5-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_cpu_utilization_writer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_freeable_memory_writer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_list_manager_health_check"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
